#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apim.module.apim_v2_wallet_pdnd_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = (known after apply)
      + description           = "API access limited by PDND token authentication"
      + display_name          = "IO Wallet - PDND"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-pdnd-api"
      + path                  = "api/v1/wallet/pdnd"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + ServiceUnavailable   = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Service Unavailable"
                            }
                          + Unauthorized         = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unauthorized"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + FiscalCode                  = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          + ProblemJson                 = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                          + SetWalletInstanceStatusData = {
                              + properties = {
                                  + fiscal_code = {
                                      + "$ref" = "#/components/schemas/FiscalCode"
                                    }
                                  + status      = {
                                      + enum = [
                                          + "REVOKED",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "status",
                                  + "fiscal_code",
                                ]
                              + type       = "object"
                            }
                        }
                      + securitySchemes = {
                          + BearerAuth = {
                              + bearerFormat = "JWT"
                              + scheme       = "bearer"
                              + type         = "http"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet API"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/status"                       = {
                          + get = {
                              + operationId = "healthCheck"
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/problem+json" = {
                                              + schema = {
                                                  + properties = {
                                                      + detail   = {
                                                          + enum = [
                                                              + "The service is healthy",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + instance = {
                                                          + enum = [
                                                              + "/status",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + status   = {
                                                          + enum   = [
                                                              + 200,
                                                            ]
                                                          + format = "int32"
                                                          + type   = "integer"
                                                        }
                                                      + title    = {
                                                          + enum = [
                                                              + "OK",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + type     = {
                                                          + enum = [
                                                              + "about:blank",
                                                            ]
                                                          + type = "string"
                                                        }
                                                    }
                                                  + type       = "object"
                                                }
                                            }
                                        }
                                      + description = "The function is health"
                                    }
                                  + "500" = {
                                      + content     = {
                                          + "application/problem+json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/ProblemJson"
                                                }
                                            }
                                        }
                                      + description = "Internal Server Error"
                                    }
                                }
                              + summary     = "Used to check if the function is healthy"
                            }
                        }
                      + "/wallet-instances/{id}/status" = {
                          + put = {
                              + description = <<-EOT
                                    Revoke the Wallet Instance. 
                                    If the Wallet Instance is already revoked, the operation succeed.
                                EOT
                              + operationId = "setWalletInstanceStatus"
                              + parameters  = [
                                  + {
                                      + in       = "path"
                                      + name     = "id"
                                      + required = true
                                      + schema   = {
                                          + type = "string"
                                        }
                                    },
                                ]
                              + requestBody = {
                                  + content = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/SetWalletInstanceStatusData"
                                            }
                                        }
                                    }
                                }
                              + responses   = {
                                  + "204" = {
                                      + description = "Wallet Instance status successfully set"
                                    }
                                  + "400" = {
                                      + "$ref" = "#/components/responses/BadRequest"
                                    }
                                  + "401" = {
                                      + "$ref" = "#/components/responses/Unauthorized"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                  + "503" = {
                                      + "$ref" = "#/components/responses/ServiceUnavailable"
                                    }
                                }
                              + summary     = "Revoke a Wallet Instance"
                            }
                        }
                    }
                  + security   = [
                      + {
                          + BearerAuth = []
                        },
                    ]
                }
            )
        }
    }

  # module.apim.module.apim_v2_wallet_pdnd_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <!-- validate the jwt using the specified OpenID configuration URLs -->
                    <validate-jwt header-name="Authorization" require-scheme="Bearer">
                        <openid-config url="https://wallet.io.pagopa.it/pdnd/openid-configuration" />
                    </validate-jwt>
                    <set-header name="Authorization" exists-action="delete" />
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim.module.apim_v2_wallet_pdnd_api.azurerm_api_management_product_api.this["io-p-wallet-pdnd-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-pdnd-api"
      + resource_group_name = "io-p-rg-internal"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
